{
  "recetas": [
    {
      "id": 1,
      "nombreReceta": "Tarta de fresas y albahaca",
      "descripcionReceta": "Combinar fresas y albahaca, ¿no te parece un acierto maravilloso? Por si te queda alguna duda, la receta de hoy las disipará todas con solo dar un mordisco a la maravillosa tarta de fresas y albahaca que hoy te muestro. Una tarta con mucho sabor y llena de aromas frescos y primaverales, perfecta para servir en cualquier momento del día.",
      "ingredientes": "150 g de mantequilla cortada en dados, 100 g de azúcar glas, 60 g de harina de almendra (almendras molidas muy finamente), 1 huevo, 1 pizca de sal, 250 g de harina",
      "instrucciones": "1. En un procesador de alimentos (a falta de él, en un bol amplio), bate la mantequilla hasta ablandarla a punto pomada.\n2. Añade el azúcar glas y la harina de almendra y mezcla.\n3.Añade la sal y el huevo y sigue mezclando hasta conseguir una consistencia homogénea.\n4. Añade la harina y mezcla el tiempo mínimo, lo justo hasta que esté integrada.\n5.Recoge la masa en una bola, envuélvela en film transparente y déjala en la nevera como mínimo una hora.\n6.Pasado ese tiempo, retírala del film y llévala a una superficie de trabajo enharinada.'\n7. Estírala con ayuda de un rodillo, dándole forma circular (los de mármol van estupendos en este tipo de masas, porque mantienen la masa fría más tiempo).\n8.Pasa la masa al molde perforado De Buyer con base extraíble (o a una bandeja perforada, disponiendo en ella un aro perforado) previamente engrasado.\n9.Baja la masa a la base y presiónala con los dedos hacia las paredes del molde (debe formar un ángulo recto entre paredes y base).\n10.Deja la masa en el molde tapada en film durante mínimo una hora (¡idealmente toda la noche!, hasta el día siguiente).\n11.Hecho el reposo, hornea la masa en el horno precalentado a 160 °C, durante 15 minutos.Transcurridos los 15 minutos, saca la masa del horno y reserva. Mantén el horno encendido.",
      "imagen": "https://cdn.shopify.com/s/files/1/0191/9978/files/1_5f502ef5-6c01-4694-b1ed-be0fb7ff2904.jpg?v=1686237776",
      "categoria": "Dulce"
    },
    {
      "id": 2,
      "nombreReceta": "Pulpo en tempura con alioli de wasabi y cilantro",
      "descripcionReceta": "¡Llega el calor y es el momento perfecto para disfrutar de deliciosas tapas y sabores refrescantes! Toma nota de esta irresistible receta de Pulpo en tempura con alioli de wasabi y cilantro, porque es una opción ideal para compartir y disfrutar en los cálidos días de verano.",
      "ingredientes": "1 pulpo (aprox. 1,2 kg, previamente congelado y descongelado*), Sal, 100 ml de vermut blanco, 1 paquete de harina de tempura (harina para freír), 1 hoja de laurel, Sal marina en escamas",
      "instrucciones": "1. Pon al fuego la cacerola alta Fusiontec Aromatic con 2 litros de agua, el vermut y la hoja de laurel.\n 2.Cuando empiecen a salir burbujas añade el pulpo (previamente lavado).\n 3.Cuece a fuego suave durante 1 hora, tapado. A continuación, escurre el líquido y deja enfriar.\n 4.Mientras, prepara el alioli: lava las limas, ralla finamente su piel y exprime el zumo. Pela el ajo.\n 5.Pon la yema del huevo en un vaso de batidora junto con la mostaza, el ajo, 2 cucharadas de zumo de lima, un poco de sal y el aceite.\n 6.Bate durante un corto espacio de tiempo, hasta que se forme una crema espesa.\n 7.Por otro lado, pica el cilantro, incluidos los tallos, añádelos al vaso de la batidora junto con las 2 cdtas de salsa wasabi, y vuelve a batir con la batidora eléctrica hasta obtener una salsa homogénea y con un tono verdoso, por el cilantro.\n 8.Traspasa la salsa a un bol o ramequín (en el que servirás la salsa), sazona con unas escamas de sal y la ralladura de lima. Pon a enfriar en el frigorífico, tapado.Con unas tijeras, corta el pulpo en trozos.\n 9. En un bol, mezcla la harina de tempura con agua fría, removiéndola según las instrucciones de la misma.\n 10.Pon aceite en el cazo Fusiontec o en una freidora de acero, y calienta el aceite a 180 °C.\n 8.Baña una a una las porciones de pulpo en la masa de tempura, escurre un poco y fríe en el aceite caliente durante 2-3 minutos, hasta que adquieran un aspecto dorado y crujiente.\n 11.Una vez listo, retira del aceite con ayuda de una espumadera y escurre sobre papel de cocina. Condimenta con la sal marina en escamas.\n 12.Para servir, corta el resto de la lima en rodajas. Saca el alioli de la nevera, remuévelo de nuevo y sazona al gusto (puedes añadir un poco de ralladura para decorarlo). Emplata el pulpo crujiente y sirve.",
      "imagen": "https://cdn.shopify.com/s/files/1/0191/9978/files/Tempura-de-pulpo-con-alioli-de-wasabi-y-cilantro-blog.jpg?v=1655116744",
      "categoria": "Salado"
    },
    {
      "nombreReceta": "prueba",
      "descripcionReceta": "descripción de prueba",
      "ingredientes": "ingredientes de prueba",
      "instrucciones": "instrucciones de prueba",
      "imagen": "https://cdn.shopify.com/s/files/1/0191/9978/files/1_5f502ef5-6c01-4694-b1ed-be0fb7ff2904.jpg?v=1686237776",
      "categoria": "Apto para Celíacos",
      "id": 3
    },
    {
      "nombreReceta": "prueba 46",
      "descripcionReceta": "fesfe",
      "ingredientes": "fesfe",
      "instrucciones": "fesfe",
      "imagen": "https://images.pexels.com/photos/14770630/pexels-photo-14770630.jpeg",
      "categoria": "Salado",
      "id": 4
    },
    {
      "nombreReceta": "prueba 46",
      "descripcionReceta": "fesfesf",
      "ingredientes": "fesfe",
      "instrucciones": "fesfesf",
      "imagen": "https://images.pexels.com/photos/14770630/pexels-photo-14770630.jpeg",
      "categoria": "Dulce",
      "id": 5
    }
  ],
  "usuarios": [
    {
      "id": 1,
      "nombreUsuario": "admin",
      "email": "admin@rollingcode.com",
      "password": "123456aA"
    }
  ]
}